#### FillPatternTarget Enumeration

---

|  |
| --- |
| See Also |

The type of the fill pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum FillPatternTarget ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FillPatternTarget ``` |

| Visual C++ |
| --- |
| ``` public enum class FillPatternTarget ``` |

# Members

| Member name | Description |
| --- | --- |
| Drafting | Represents a material in symbolic form. |
| Model | Represents an actual element appearance on a building. |
| None |  |

# See Also

Autodesk.Revit.DB Namespace